<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"local","plan_modifier":"051a6df03c1b94ddb53b9a5329a560edecfe2c5bcd6a6a36ac0b75d175265fcb","backend":"7b84abc642929708ee4fbeefa982422f8fe760fc25be6276390af56c017a9e86","plan_job_ref":"Job Test actions using target and replace #435 at https://github.com/dflook/terraform-github-actions/actions/runs/12446916587","plan_out_hash":"a62bbc2ea1cc1c3d4112bfb6869e9f88365db1982c9be283e0f8c1b9fc566b34","plan_hash":"0d6d9c8e4e7d5655ca0d223f42d51145976e93f059728b67299ae7d070a5bd91","plan_text_format":"diff","version":"99.0.0"} -->
Terraform plan in __tests/workflows/test-target-replace__
Replacing resources: `random_string.foreach["hello"]`, `random_string.count[0]`
With variables: `length = 10`
<details>
<summary>Plan: 2 to add, 0 to change, 2 to destroy. Changes to Outputs.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # random_string.count[0] will be replaced, as requested
-/+ resource "random_string" "count" {
!~      id          = "**********" -> (known after apply)
!~      result      = "**********" -> (known after apply)
#        (10 unchanged attributes hidden)
    }

  # random_string.foreach["hello"] will be replaced, as requested
-/+ resource "random_string" "foreach" {
!~      id          = "**********" -> (known after apply)
!~      result      = "**********" -> (known after apply)
#        (10 unchanged attributes hidden)
    }

Plan: 2 to add, 0 to change, 2 to destroy.

Changes to Outputs:
!~  count   = "B1opCYcOTH" -> (known after apply)
!~  foreach = "H9vsr6PG23" -> (known after apply)
```
</details>

:memo: Plan generated in [Test actions using target and replace #435](https://github.com/dflook/terraform-github-actions/actions/runs/12446916587)